app/controllers/matches_controller.rb

INSERT INTO `matches` (`created_at`, `matched_trip_id`, `trip_id`, `updated_at`) VALUES ('2013-07-22 04:29:58', 14, 26, '2013-07-22 04:29:58')
---
def choose
  @match=Match.new(match_params)

  if @match.save

SELECT `matches`.* FROM `matches` WHERE `matches`.`trip_id` = 26 LIMIT 1
---
def show
	@match=Match.where("trip_id=#{params[:trip_id]}")