app/controllers/trips_controller.rb

INSERT INTO `trips` (`created_at`, `departure`, `destination`, `lat_dest`, `lat_src`, `long_dest`, `long_src`, `source`, `updated_at`, `user_id`) VALUES ('2013-07-16 09:24:48', '2013-07-16 09:01:00', 'bangalore', 12.9715987, 22.572646, 77.59456269999998, 88.36389499999996, 'kolkata', '2013-07-16 09:24:48', 2)
---
  def create
  	@trip=Trip.new(trips_params)
  	if @trip.save

SELECT `trips`.* FROM `trips` WHERE (lat_src<=22.581633709226743044 and lat_src>=22.563658290773256956 and long_src<=88.373627538153771501 and long_src>=88.354162461846148499 and lat_dest<=12.980586409226743044 and lat_dest>=12.962610990773256956 and long_dest<=77.603785524770480524 and long_dest>=77.585339875229479476 and id!=26 and user_id!=2)
SELECT `trips`.* FROM `trips` WHERE (lat_src<=12.950759809226743044 and lat_src>=12.932784390773256956 and long_src<=77.575442221365770328 and long_src>=77.556998778634209672 and lat_dest<=12.944014809226743044 and lat_dest>=12.926039390773256956 and long_dest<=77.620208672224007635 and long_dest>=77.601765727775892365)
SELECT trips.*,users.first_name,users.last_name,users.gender, users.dob, users.mobile, users.email FROM `trips` inner join users on user_id=users.id WHERE (lat_src<=22.581633709226743044 and lat_src>=22.563658290773256956 and long_src<=88.373627538153771501 and long_src>=88.354162461846148499 and lat_dest<=12.980586409226743044 and lat_dest>=12.962610990773256956 and long_dest<=77.603785524770480524 and long_dest>=77.585339875229479476 and trips.id!=26 and user_id!=5)
---
  def matches
  	if params[:id]
  		@trip= Trip.find_by id: params[:id]
  		if !@trip.blank?
  			@lat_src=@trip.lat_src
  			@long_src=@trip.long_src
  			@lat_dest=@trip.lat_dest
  			@long_dest=@trip.long_dest

  			@R=6378137.0
  			@lat_offset=1000.0;
  			@long_offset=1000.0;
  			@lat_displacement = (@lat_offset/@R)
			@long_displacement = @long_offset/(@R*Math.cos(3.14*@lat_src/180))

  			@pos_src_lat=@lat_src + @lat_displacement*180/3.14
  			@neg_src_lat=@lat_src - @lat_displacement*180/3.14
  			@pos_src_long=@long_src + @long_displacement*180/3.14
  			@neg_src_long=@long_src - @long_displacement*180/3.14

  			@long_displacement = @long_offset/(@R*Math.cos(3.14*@lat_dest/180))
  			@pos_dest_lat=@lat_dest + @lat_displacement*180/3.14
  			@neg_dest_lat=@lat_dest - @lat_displacement*180/3.14
  			@pos_dest_long=@long_dest + @long_displacement*180/3.14
  			@neg_dest_long=@long_dest - @long_displacement*180/3.14

  			@trips=Trip.select("trips.*,users.first_name,users.last_name,users.gender, users.dob, users.mobile, users.email").joins("inner join users on user_id=users.id").where("lat_src<=#{@pos_src_lat} and lat_src>=#{@neg_src_lat} and long_src<=#{@pos_src_long} and long_src>=#{@neg_src_long} and lat_dest<=#{@pos_dest_lat} and lat_dest>=#{@neg_dest_lat} and long_dest<=#{@pos_dest_long} and long_dest>=#{@neg_dest_long} and trips.id!=#{@trip.id} and user_id!=#{@trip.user_id}")

SELECT `trips`.* FROM `trips` WHERE (user_id = 2)
---
  def all
  	@trips= Trip.where("user_id = #{params[:user_id]}")

SELECT `trips`.* FROM `trips` WHERE `trips`.`user_id` = 2 LIMIT 1
---
  def show
  	@trip=Trip.where("user_id = #{params[:id]}")

SELECT `trips`.* FROM `trips` WHERE `trips`.`id` = 11 LIMIT 1
---
  def edit
  	@trip=Trips.find(params[:id])