app/controllers/users_controller.rb

  def login
  	if params[:login]
  		@user= Users.find_by mobile: params[:username]
---
SELECT `users`.* FROM `users` WHERE `users`.`mobile` = '9538591855' LIMIT 1

  def create
    @user = Users.new(user_params)
    if @user.save
---
INSERT INTO `users` (`created_at`, `dob`, `email`, `first_name`, `gender`, `last_name`, `mobile`, `password`, `updated_at`) VALUES ('2013-07-02 14:06:43', '1990-12-02', 'rohan.poddar@gmail.com', 'Rohan', 'male', 'Poddar', '09538591855', 'reset123', '2013-07-02 14:06:43')